<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<!--Converted with LaTeX2HTML 2002 (1.67)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Objetivos</TITLE>
<META NAME="description" CONTENT="Objetivos">
<META NAME="keywords" CONTENT="principal">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2002">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="principal.css">

<LINK REL="next" HREF="node6.html">
<LINK REL="previous" HREF="node4.html">
<LINK REL="up" HREF="node3.html">
<LINK REL="next" HREF="node6.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html391"
  HREF="node6.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/local/share/lib/latex2html/icons/next.png"></A> 
<A NAME="tex2html387"
  HREF="node3.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/local/share/lib/latex2html/icons/up.png"></A> 
<A NAME="tex2html381"
  HREF="node4.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/local/share/lib/latex2html/icons/prev.png"></A> 
<A NAME="tex2html389"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/local/share/lib/latex2html/icons/contents.png"></A>  
<BR>
<B> Siguiente:</B> <A NAME="tex2html392"
  HREF="node6.html">Alcance</A>
<B> Subir:</B> <A NAME="tex2html388"
  HREF="node3.html">Introducción</A>
<B> Anterior:</B> <A NAME="tex2html382"
  HREF="node4.html">Motivación</A>
 &nbsp <B>  <A NAME="tex2html390"
  HREF="node1.html">&#205;ndice General</A></B> 
<BR>
<BR>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION02120000000000000000">
Objetivos</A>
</H1>

El objetivo general del presente proyecto es el desarrollo de una
herramienta de predicci&#243;n de p&#233;rdida de camino de se&#241;ales celulares
para entornos urbanos y suburbanos de caracter&#237;sticas heterog&#233;neas.
La misma consistir&#225; en un software que pueda calcular a partir de
los datos topogr&#225;ficos del entorno, ubicaci&#243;n y caracter&#237;sticas de
las antenas radiobases, la potencia mediana de la se&#241;al recibida en
cualquier punto del terreno. Para ello se utilizar&#225;n distintos
modelos de propagaci&#243;n para los entornos mencionados.

El software deber&#225; aceptar datos con distintos niveles de detalle,
incluyendo el mapa de alturas de terreno, el trazado de las manzanas
y la disposici&#243;n y altura de las edificaciones. Los formatos
utilizados deber&#225;n ser reconocidos internacionalmente.

Para el c&#225;lculo de la atenuaci&#243;n se utilizar&#225;n diversos modelos de
propagaci&#243;n, y se intentar&#225; cubrir la mayor cantidad de escenarios
posibles. Los modelos deber&#225;n ser configurables por el usuario (es
decir, se podr&#225;n fijar arbitrariamente los par&#225;metros que los
definen). Esto es con el fin de lograr la mayor flexibilidad
posible, caracter&#237;stica a buscar en todos los aspectos del dise&#241;o.

La herramienta debe ser de f&#225;cil manejo, de forma que el usuario
pueda interactuar con la misma de forma natural, mediante una
interfaz gr&#225;fica amigable y clara. Ser experto en la teor&#237;a no debe
ser una condici&#243;n necesaria para poder utilizarla y obtener
resultados razonables.

Es tambi&#233;n una caracter&#237;stica deseable, que el software pueda
funcionar bajo distintos sistemas operativos, de forma de no
restringir su uso a una determinada plataforma, y que los tiempos de
ejecuci&#243;n sean razonables. Para lograr esto &#250;ltimo se intentar&#225;
minimizar los tiempos de c&#225;lculo mediante algoritmos
eficientes, sin necesidad de perder confiabilidad en los resultados.

Como se mencion&#243; en la secci&#243;n anterior, la herramienta de
software pretende ser parte de un desarrollo m&#225;s general, por lo
cual es condici&#243;n imprescindible que el c&#243;digo generado sea
f&#225;cilmente reutilizable.

Como objetivos secundarios, necesarios para la concreci&#243;n del
objetivo final, se encuentran el estudio y an&#225;lisis de los
fundamentos te&#243;ricos, que incluyen todos los aspectos relativos a la
propagaci&#243;n, caracter&#237;sticas de la se&#241;al celular, modelos de
predicci&#243;n, as&#237; como el entendimiento de los procedimientos
matem&#225;ticos necesarios para la implementaci&#243;n de los diferentes
c&#225;lculos. Tambi&#233;n cabe mencionar la familiarizaci&#243;n con el lenguaje
y el entorno de programaci&#243;n, as&#237; como el manejo de datos del tipo
cartograf&#237;as digitales.
    <HR>
<!--Navigation Panel-->
<A NAME="tex2html391"
  HREF="node6.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/local/share/lib/latex2html/icons/next.png"></A> 
<A NAME="tex2html387"
  HREF="node3.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/local/share/lib/latex2html/icons/up.png"></A> 
<A NAME="tex2html381"
  HREF="node4.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/local/share/lib/latex2html/icons/prev.png"></A> 
<A NAME="tex2html389"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/local/share/lib/latex2html/icons/contents.png"></A>  
<BR>
<B> Siguiente:</B> <A NAME="tex2html392"
  HREF="node6.html">Alcance</A>
<B> Subir:</B> <A NAME="tex2html388"
  HREF="node3.html">Introducción</A>
<B> Anterior:</B> <A NAME="tex2html382"
  HREF="node4.html">Motivación</A>
 &nbsp <B>  <A NAME="tex2html390"
  HREF="node1.html">&#205;ndice General</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
SAPO
</ADDRESS>
</BODY>
</HTML>
