<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<!--Converted with LaTeX2HTML 2002 (1.67)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Elección del lenguaje de programación</TITLE>
<META NAME="description" CONTENT="Elección del lenguaje de programación">
<META NAME="keywords" CONTENT="principal">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2002">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="principal.css">

<LINK REL="next" HREF="node44.html">
<LINK REL="previous" HREF="node42.html">
<LINK REL="up" HREF="node42.html">
<LINK REL="next" HREF="node44.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html976"
  HREF="node44.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/local/share/lib/latex2html/icons/next.png"></A> 
<A NAME="tex2html972"
  HREF="node42.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/local/share/lib/latex2html/icons/up.png"></A> 
<A NAME="tex2html966"
  HREF="node42.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/local/share/lib/latex2html/icons/prev.png"></A> 
<A NAME="tex2html974"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/local/share/lib/latex2html/icons/contents.png"></A>  
<BR>
<B> Siguiente:</B> <A NAME="tex2html977"
  HREF="node44.html">Introducción a GIS</A>
<B> Subir:</B> <A NAME="tex2html973"
  HREF="node42.html">Aspectos previos al desarrollo</A>
<B> Anterior:</B> <A NAME="tex2html967"
  HREF="node42.html">Aspectos previos al desarrollo</A>
 &nbsp <B>  <A NAME="tex2html975"
  HREF="node1.html">&#205;ndice General</A></B> 
<BR>
<BR>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION04110000000000000000">
Elecci&#243;n del lenguaje de programaci&#243;n</A>
</H1>

Para el desarrollo de <I>SAPO</I> se opt&#243; por utilizar Java,
dentro de la amplia gama de lenguajes de programaci&#243;n existentes.
Java presenta varias ventajas que justifican su elecci&#243;n, siendo
adem&#225;s un lenguaje con el cual los integrantes del presente proyecto
ya se encontraban familiarizados. Entre las mismas se puede
destacar:

<UL>
<LI><I>Programaci&#243;n orientada a objetos.</I> Java permite aprovechar
la flexibilidad y versatilidad de la programaci&#243;n orientada a
objetos en el dise&#241;o de sus aplicaciones.
</LI>
<LI><I>Simplicidad.</I> Est&#225; pensado para ser m&#225;s f&#225;cil para el
desarrollador que otros lenguajes orientados a objetos (como C++),
permitiendo crear c&#243;digo m&#225;s robusto en menor tiempo. Reduce en gran
medida los errores m&#225;s comunes de programaci&#243;n con lenguajes como C
y C++ al eliminar muchas de las caracter&#237;sticas menos usadas y m&#225;s
confusas de &#233;stos, sin dejar de ofrecer toda la funcionalidad de un
lenguaje potente. Su estructura simple y clara permite generar
programas f&#225;cilmente legibles.
</LI>
<LI><I>Portabilidad.</I> La plataforma Java proporciona una &#250;nica
interface est&#225;ndar para ejecutar aplicaciones en cualquier m&#225;quina y
en la mayor&#237;a de los sistemas operativos, ya que es independiente de
la plataforma de desarrollo. Un programa creado en Java, cuando es
compilado se convierte en un c&#243;digo de bits de alto nivel que, en
vez de ser espec&#237;fico de una arquitectura, incluye instrucciones
para ser ejecutadas en una m&#225;quina virtual, independientemente del
sistema operativo. Esto es posible gracias a que el coraz&#243;n de la
plataforma es la m&#225;quina virtual Java.
</LI>
<LI><I>Amplia difusi&#243;n.</I> El JDK<A NAME="tex2html24"
  HREF="footnode.html#foot1737"><SUP>6.1</SUP></A> (<I>Java Development Kit</I>) es
una herramienta libre de licencias (sin costo) y est&#225;
respaldada por un gran n&#250;mero de proveedores. Su amplia difusi&#243;n a
nivel mundial permite un f&#225;cil acceso a documentaci&#243;n, bibliograf&#237;a
y foros. Cuenta con una rica gama de bibliotecas, herramientas para
soporte de todo tipo de aplicaciones.
</LI>
<LI><I>Robustez.</I> Java pone gran &#233;nfasis en chequeo de posibles errores e
inconsistencias, realizando verificaciones tanto en tiempo de
compilaci&#243;n como en tiempo de ejecuci&#243;n. La comprobaci&#243;n de tipos en
Java ayuda a detectar errores lo antes posible en el ciclo de
desarrollo. Cuenta con manejo de excepciones en tiempo de ejecuci&#243;n,
lo cual le da al desarrollador la posibilidad de crear un programa
robusto y capaz de continuar la ejecuci&#243;n en caso de presentarse un
error.
</LI>
</UL>
La principal limitaci&#243;n de Java en comparaci&#243;n con otros lenguajes
es la velocidad de ejecuci&#243;n; como los programas de Java son
interpretados nunca alcanzan la velocidad de un verdadero
ejecutable. En el caso del presente proyecto, los tiempos de
ejecuci&#243;n no son un elemento cr&#237;tico, ya que no tiene requerimientos
de tiempo real. Si bien es un aspecto a tener en cuenta, la
optimizaci&#243;n de los tiempos no es un requisito indispensable, por lo
cual no constituy&#243; un elemento decisivo a la hora de hacer la
elecci&#243;n, frente a ventajas como las anteriormente mencionadas. S&#237;
se buscar&#225; la minimizaci&#243;n de los tiempos de c&#225;lculo mediante el
dise&#241;o e implementaci&#243;n de algoritmos eficientes.

Un aspecto importante en el desarrollo del presente software es la
manipulaci&#243;n de informaci&#243;n espacial, para lo cual se decidi&#243;
trabajar en el marco de GIS (<I>Geographic Information System</I>)
[<A
 HREF="node130.html#GIS">27</A>], por su gran utilidad y difusi&#243;n. Java cuenta con
herramientas espec&#237;ficas para el desarrollo de aplicaciones de este
tipo, como se ver&#225; m&#225;s en detalle en las siguientes secciones.

<HR>
<!--Navigation Panel-->
<A NAME="tex2html976"
  HREF="node44.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next"
 SRC="file:/usr/local/share/lib/latex2html/icons/next.png"></A> 
<A NAME="tex2html972"
  HREF="node42.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up"
 SRC="file:/usr/local/share/lib/latex2html/icons/up.png"></A> 
<A NAME="tex2html966"
  HREF="node42.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous"
 SRC="file:/usr/local/share/lib/latex2html/icons/prev.png"></A> 
<A NAME="tex2html974"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents"
 SRC="file:/usr/local/share/lib/latex2html/icons/contents.png"></A>  
<BR>
<B> Siguiente:</B> <A NAME="tex2html977"
  HREF="node44.html">Introducción a GIS</A>
<B> Subir:</B> <A NAME="tex2html973"
  HREF="node42.html">Aspectos previos al desarrollo</A>
<B> Anterior:</B> <A NAME="tex2html967"
  HREF="node42.html">Aspectos previos al desarrollo</A>
 &nbsp <B>  <A NAME="tex2html975"
  HREF="node1.html">&#205;ndice General</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
SAPO
</ADDRESS>
</BODY>
</HTML>
